Revit 2027 API
MultistoryStairs.IsAcceptableForMultistoryStairs Method
 Checks if the given stairs can be used to create a multistory stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsAcceptableForMultistoryStairs(
	Stairs stairs
)
Public Shared Function IsAcceptableForMultistoryStairs (
	stairs As Stairs
) As Boolean
public:
static bool IsAcceptableForMultistoryStairs(
	Stairs^ stairs
)
static member IsAcceptableForMultistoryStairs :
        stairs : Stairs -> bool
Parameters
stairs Stairs
 The given stairs to check.
Return Value
Boolean
 Returns true if the stairs can be used to create a multistory stairs; otherwise returns false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace